[
  {
      "bookId": 1,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/wBhh1BK/The-Great-Gatsby-Cover-1925-Retouched.jpg",
      "review": "A timeless classic that explores the decadence and disillusionment of the Jazz Age. Fitzgerald's prose dazzles with its vivid imagery and poignant symbolism, offering a scathing critique of the American Dream amidst the glittering excess of the 1920s. The characters, particularly the enigmatic Jay Gatsby, resonate with depth and complexity, leaving an indelible mark on the reader's psyche.",
      "totalPages": 180,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["Classic", "Literature"],
      "publisher": "Scribner",
      "yearOfPublishing": 1925
  },
  {
      "bookId": 2,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/3Y7ZB49/To-Kill-a-Mockingbird-first-edition-cover.jpg",
      "review": "An emotionally charged narrative that confronts themes of racial injustice and moral growth in the American South. Through the innocent eyes of Scout Finch, Lee masterfully delves into the complexities of human nature and societal prejudice. Atticus Finch stands as a beacon of integrity and righteousness, inspiring readers to question societal norms and fight for justice.",
      "totalPages": 324,
      "rating": 4.8,
      "category": "Fiction",
      "tags": ["Classic", "Social Issues"],
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": 1960
  },
  {
      "bookId": 3,
      "bookName": "1984",
      "author": "George Orwell",
      "image": "https://i.ibb.co/nwbcVFL/1984-play-artwork.jpg",
      "review": "A dystopian masterpiece that serves as a stark warning against totalitarianism and the erosion of individual freedoms. Orwell's grim vision of a surveillance state resonates with chilling relevance in today's world, prompting readers to question the nature of power and authority. Winston Smith's rebellion against Big Brother captivates with its desperation and futility, leaving a haunting impression long after the final page.",
      "totalPages": 328,
      "rating": 4.7,
      "category": "Fiction",
      "tags": ["Dystopian", "Political"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
  },
  {
      "bookId": 4,
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co/zX2t2bz/800px-The-Catcher-in-the-Rye-1951-first-edition-cover.jpg",
      "review": "A poignant portrayal of teenage angst and alienation in post-World War II America. Salinger's narrative voice, embodied by the irreverent Holden Caulfield, captures the disillusionment and longing for authenticity that define adolescence. Through Holden's misadventures in New York City, Salinger crafts a timeless coming-of-age tale that resonates with readers of all generations.",
      "totalPages": 224,
      "rating": 4.4,
      "category": "Fiction",
      "tags": ["Classic", "Satire"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
  },
  {
      "bookId": 5,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/NW64dH0/Pride-And-Prejudice-Title-Page.jpg",
      "review": "A charming romantic comedy of manners set in early 19th-century England. Austen's wit and keen observation of society are on full display as she navigates the complexities of love and class through the spirited Elizabeth Bennet and the proud Mr. Darcy. With its timeless themes of prejudice, love, and societal expectations, Pride and Prejudice continues to enchant readers worldwide.",
      "totalPages": 432,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["Classic", "Romance"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
  },
  {
      "bookId": 6,
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/pPyThTj/The-Hobbit-First-Edition.jpg",
      "review": "An enchanting tale of adventure and friendship in Middle-earth. Tolkien's richly imagined world and delightful characters, from the courageous Bilbo Baggins to the wise Gandalf, captivate readers of all ages. The journey to reclaim the lost treasure of Erebor brims with danger, humor, and unexpected heroism, making The Hobbit a timeless classic of fantasy literature.",
      "totalPages": 320,
      "rating": 4.9,
      "category": "Fantasy",
      "tags": ["Adventure", "Quest"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1937
  },
  {
      "bookId": 7,
      "bookName": "Harry Potter and the Philosopher's Stone",
      "author": "J.K. Rowling",
      "image": "https://i.ibb.co/Kz97p4z/Harry-Potter-and-the-Philosopher-s-Stone-Book-Cover.jpg",
      "review": "A captivating start to the iconic series, introducing readers to the magical world of Hogwarts. Rowling's imaginative storytelling and vivid characters, including the endearing Harry, Hermione, and Ron, transport readers into a realm of wonder and adventure. The discovery of Harry's wizarding heritage and his journey to thwart the dark wizard Voldemort enthral readers of all ages.",
      "totalPages": 320,
      "rating": 4.7,
      "category": "Fantasy",
      "tags": ["Magic", "Friendship"],
      "publisher": "Bloomsbury Publishing",
      "yearOfPublishing": 1997
  },
  {
      "bookId": 8,
      "bookName": "The Hunger Games",
      "author": "Suzanne Collins",
      "image": "https://i.ibb.co/P5pJXkx/The-Hunger-Games.jpg",
      "review": "A thrilling dystopian tale where young tributes fight for survival in a televised spectacle. Collins' gripping narrative plunges readers into the heart of Panem, a society divided by cruelty and oppression. Through Katniss Everdeen's courageous defiance and resilience, The Hunger Games explores themes of sacrifice, power, and the human spirit's capacity for hope.",
      "totalPages": 374,
      "rating": 4.3,
      "category": "Young Adult",
      "tags": ["Dystopian", "Survival"],
      "publisher": "Scholastic Corporation",
      "yearOfPublishing": 2008
  },
  {
    "bookId": 9,
   "bookName": "The Lord of the Rings: The Fellowship of the Ring",
   "author": "J.R.R. Tolkien",
   "image": "https://i.ibb.co/52cxBrd/The-Lord-of-the-Rings-TFOTR-2001.jpg",
   "review": "An epic journey across Middle-earth, filled with adventure, danger, and camaraderie. Tolkien's masterful storytelling transports readers to a world of myth and magic, where the fate of civilizations hangs in the balance. From the tranquil beauty of the Shire to the dark depths of Moria, every step of the Fellowship's quest is fraught with peril and wonder. As Frodo Baggins carries the burden of the One Ring, he discovers courage and resilience amidst the shadows of Mordor, forging bonds of friendship that endure the test of time.",
    "totalPages": 432,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Epic", "Adventure"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1954
  }
]